Revit 2027 API
PartMakerMethodToDivideVolumes.IsValidSketchPlane Method
 Identifies if provided sketch plane is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidSketchPlane(
	Document document,
	ElementId sketchPlaneId
)
Public Shared Function IsValidSketchPlane (
	document As Document,
	sketchPlaneId As ElementId
) As Boolean
public:
static bool IsValidSketchPlane(
	Document^ document,
	ElementId^ sketchPlaneId
)
static member IsValidSketchPlane :
        document : Document *
        sketchPlaneId : ElementId -> bool
Parameters
document Document
 The document.
sketchPlaneId ElementId
 SketchPlane ids to be tested for validity for PartMaker.
Return Value
Boolean
 True if SketchPlane valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace